Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: According to a story from Bhagavata Purana, Hiranyakashipu and Hiranyaksha are Vishnu's gatekeepers Jaya and Vijaya, born on earth as the result of a curse from the Four Kumaras. In Satya Yuga, Hiranyakashipu and Hiranyaksha - together called the Hiranyas - were born to Diti (daughter of Daksha Prajapathi) and the sage Kashyapa. It is said that asuras were born to them as a result of their union at the time of dusk, which was said to be an inauspicious time for such a deed.[3]
ne: श्रीमद्भागवत् पुराण अनुसार, हिरण्यकश्यपु र हिरण्याक्ष विष्णुका द्वारपाले जय र विजयको पुनर्जन्म थिए जो चार कुमारको श्राप को कारण पृथ्वीमा जन्मेका थिए । सत्य युगमा, हिरण्यकश्यपु र हिरण्याक्ष दितिको गर्भबाट(दक्ष प्रजापति को छोरी) र कश्यप ऋषिबाट जन्मे । उनी हरुको जन्म अशुभ समयमा भएको हुनाले ( सन्ध्या कालिन समयमा) उनीहरु असुर भएर जन्मे।

source: After Hiranyakashipu's younger Brother Hiranyaksha's death at the hands of the Varaha avatar of Vishnu, Hiranyakashipu comes to hate Vishnu. He decides to kill him by gaining mystical powers, which he believes Brahma, the chief among the devas, will award to him if he undergoes many years of great austerity and penance, just as Brahma awarded powers to other Rakshasas.
ne: हिरण्याक्ष राजा थिए । उनको पापको र क्रूरताको श्रृंखलाले सीमा नाघेपछि भगवान विष्णुले बराह अवतार धारण गरि उनको बध गरे । जसको बदला लिन हिरण्याक्षका भार्इ हिरण्यकशिपुले ब्रह्मलार्इ प्रशन्न पारी वरदान लिनकालागि कठोर तपस्य गर्यो ।

source: O my lord, O best of the givers of benediction, if you will kindly grant me the benediction I desire, please let me not meet death from any of the living entities created by you. Grant me that I not die within any residence or outside any residence, during the daytime or at night, nor on the ground or in the sky. Grant me that my death not be brought by any being other than those created by you, nor by any weapon, nor by any human being or animal.
ne: कठोर तपस्याबाट प्रभावित भएर दर्शन दिनुभयो र वरदान के माग्छाै भनेर अाज्ञा भयो । हिरण्यकशिपुले भगवान महादेवसंग अमर हुने वरदान माग्यो जुन अाग्रहलार्इ भगवान महादेवले अस्वीकार गर्नुभयो । यो हेरेर हिरण्यकशिपुले एउटा जुक्ति लगायो र अर्को वरदान माग्यो, र भन्योः न म भित्र मरूँ, न बाहिर । न भूमीमा, न अाकाशमा, न जलमा मरूँ ।। न अस्त्रले मरूँ, न शस्त्रले । न मनुष्यको हाथले मरूँ, न पशुद्वारा मरूँ ।। हिरण्यकशिपुको यो अाग्रहलार्इ भगवान महादेवले तथास्तुः भनेर अन्तरध्यान हुनुभयो । यो वरदान पाएर अब उ अाफूलार्इ अजर अमर ठान्न थाल्यो र उसले अाफूलार्इ नै भगवान घोषणा गरीदियो । त्यसपछि उसको अत्याचार, अन्याय र पापका श्रृंखला यति बढ्न थाल्यो की चारैतिर त्राहिमाम-त्राहिमाम मच्चिन थाल्यो । केहि समयपश्चात् हिरण्यकस्यपुको दरबारमा एउटा बालकको जन्मभयो जसको नाम प्रह्लाद राखियो । प्रह्लाद बुझ्ने हुनथाले र विस्तारै उनको पिताले अाफूलार्इ भगवान ठानेको भ्रमलार्इ अस्विकार गर्नथाले । भगवान र भगवानप्रतिको उनको विश्वासमा कुम्हालेको अाभामा अागलागी पश्चात् पनि बाँचेको बिरालो ठूलो बन्न गयो, त्यस घटनाले प्रह्लादको मनमा भगवानप्रति थप निष्ठा बढाउन ठूलो भूमीका खेल्यो ।

source: Whilst Hiranyakashipu is performing the penance to be granted this boon, Indra and the other devas attack his home,[6] seizing the opportunity in his absence. At this point the divine sage Narada intervenes to protect Hiranyakashipu's wife Kayadhu,[7] whom he describes as 'sinless'.[8] Narada takes Kayadhu into his care, and while she is under his guidance, her unborn child (Hiranyakashipu's son) Prahlada becomes affected by the transcendental instructions of the sage even in the womb. Later, growing as a child, Prahlada begins to show symptoms of Narada's prenatal training and gradually becomes recognised as a devoted follower of Vishnu, much to his father's disappointment.[9]
ne: हिरण्यकश्यपु तपस्या गरिरहेका बेला , देवहरुले उनको निवासमा आक्रमण गरे । नारद मुनिले उनकी पत्नी कयधुलाई बचाए । कायधु त्यतिबेला गर्भवती थिइन् । नारद मुनिले दिएका आज्ञा र ज्ञानले गर्भमा रहेका प्रह्लादमा प्रभाव पर्यो र उनी विष्णुका अनन्य भक्त बने । पछी उनी हुर्कदै ठुलो हुदै जादा उनी विष्णु भक्त भनेर चिनी जुन उनका पितालाई मन परेको थिएन ।

source: Vishnu has chosen here to appear in the form of Narasimha in order to be able to kill Hiranyakashipu without violating the boon given by Brahma. Hiranyakashipu cannot be killed by human, deva or animal, but Narasimha is none of these, as he is a form of Vishnu (a deva) incarnate as part human, part animal. He comes upon Hiranyakashipu at twilight (when it is neither day nor night) on the threshold of a courtyard (neither indoors nor out), and puts the demon on his thighs (neither earth nor space).
ne: विष्णु ब्रह्माले हिरण्यकश्यपुलाई दिएको वरदान उल्लंघन नहुने गरि हिरण्यकश्यपुको बध गर्न नरसिंहको रुपमा प्रस्तुत भए । हिरण्यकश्यपुलाई कुनै मानव, देव वा जनावरले मार्न सक्दैनथ्यो तर नरसिंह यी कुनै पनि थिएनन् । उनी सन्ध्याकालिन समयमा प्रकट भए ( न दिन या न रात ) , दैलो मा ( न भित्र न बाहिर) , आफ्नी काखमा राखे ( न पृथ्वी न अन्तरिक्ष) र आफ्नो नङले मारे ( न हात न हतियार) ।

source: Even after Hiranyakashipu's death, none of the gods and demigods present are able to calm Narasimha's fury. So all the gods and goddesses call His consort, the goddess Lakshmi, but she is also unable to do so. Then, at the request of Brahma, Prahlada is presented to Narasimha, who is finally calmed by the prayers of his devotee.[13]
ne: हिरण्यकश्यपुको बध भएपछी पनि नरसिंह अवतारको रिस शान्त भएको थिएन । त्यसैले सबै देवी देवताहरु लक्ष्मीलाई अनुरोध गरे तर उनले आफु असक्षम रहेको कुरा बताइन । त्यसपछी ब्रह्मले प्रह्लादलाई नरसिंहको सामु प्रस्तुत गरे , र आफ्नो भक्तको प्राथना देखेर नरसिंह अन्ततः शान्त भए ।

source: One of Hiranyakashipu's attempts to kill Prahlada was to have him sit on a burning pyre with his sister Holika. Holika had a special gift that prevented her from being harmed by fire. Prahlada chanted Vishnu's name and in the battle of good against evil, Holika was burnt down but nothing happened to Prahlad.
ne: होलिकासंग आगोले केहि नहुने बरदान थियो । त्यसकारण उनले प्रह्लादलाई आगो लिएर जलाउने प्रयास गरे तर विष्णुको प्रभावले प्रह्लादलाई केहि भएन तर होलिका आफनी जलेर खरानी भईन । होलिकाको दहन भएकोलाई होली भनेर मनाइन्छ ।

source: Bhagavata Purana Vishnu Purana
ne: श्रीमद्भागवत् पुराण

source: Family
ne: वंशावली

source: Story
ne: कथा

source: Bana (also called Banasura) was a Hindu mythological figure. Bana was a thousand-armed Asura king, and the son of Bali.[1][2] Banasura is believed to have ruled the present-day central Assam with his capital at Sonitpur (present-day Tezpur, Assam). According to the legend, Banasura was an aboriginal king.
ne: वाणासुर हिन्दु पौराणिक मिथकीय पात्र हुन् । वाणासुर एक हजार हात भएका असुर राजा थिए र उनलाई सहस्रबाहु तथा भूतराज पनि भनिन्थ्यो । उनी दानवीर बलि राजा का पुत्र थिए ।[1][2] वाणासुरले हालको मध्य आसाम मा उनको राज्य थियो जहाँ उनको राजधानी शोणितपुर जिल्ला ( वर्तमानमा तेजपुर, आसाम ) किंबदन्ती अनुसार , वाणासुर एक आदिवासी राजा थिए ।

source: Chitralekha was a talented artist who helped Ushas to identify the young man seen in her dream by sketching various portraits. She had dreamt of Aniruddha, the grandson of Krishna. Chitralekha, through supernatural powers, abducted Aniruddha from the palace of Krishna and brought him to Ushas.[3], which led to a fight between Krishna and Banasura.[4][5][6][7] Shiva came to rescue his devotee, but was put to sleep by Krishna who invoked 'Jrimbhunastra'.[8] Thereafter, Krishna started severing the arms of Banasura and cut off all of them except for two.
ne: वाणासुर, एक समय ठुलो साम्राज्यमा राज्य गर्दथे ।उनक प्रभाव यति ठुलो थियो कि वरपरका राज्य का सबै राजा - देवहरु समेत उनी संग डराउथे । वाणासुर रसालिंगको पुजा गर्दे , जुन उनलाई विष्णु को सल्लाहमा विश्वकर्माले दिएका थिए । भगवान शिवको ठुला भक्त रहेका उनी , शिव ताण्डव नृत्य नाचेका बेला आफ्नी हजार हातले मृदंगा बजाउने गर्थे । भगवान शिवले उनलाई आशिस दिन खोज्दा उनले शिवलाई आफ्नो रक्षक हुन् अनुरोध गरेका थिए , त्यसकारण उनी अपराजेय रहे । .तर समय संगै उनी अझ झन् झन् क्रुर र अभिमानी हुदै गए ।उनले आफ्नी छोरी लाई समेत अग्निगृहमा नजरबन्द गरेका थिए । एक दिन उनले सपनामा एक युबकलाई देखे र उनी उनको प्रेममा मग्न भईन । उनकी संगिनी चित्रलेखा एक नामुद चित्रकार थिइन् र उनले सपनामा आएका ती युवक'को चित्र बनेर पहिचान गराईदिइन् । उनले सपनामा कृष्णका नाति अनिरुद्र लाई सपनामा देखेका थिए । उनले आफ्नो ईश्वरीय शक्तिले अनिरुद्रलाई कृष्णको दरबारबाट उषाको अगाडी ल्याइन् । [3], यहि सिलसिलामा कृष्ण र वाणासुरको युद्ध भयो । [4][5][6][7] शिव आफ्नो भक्तको रक्षा गर्न आए तर कृष्णले ज्रिम्भुनाष्त्र प्रहार गरि शिव निदाउन पुगे । [8] त्यसपछी कृष्णले वाणासुरको दुई हात बाहेक सबै हात काटी दिए । जब शिव होसमा आए उनले आफ्नो भक्त'को रक्षा गर्न कृष्णलाई अपिल गरे । वाणासुरले पनि कृष्णसंग क्षमा मागे । कृष्णले क्षमा दिए । र उषा र अनिरुद्रको विवाह भयो ।

source: The genealogy of Banasura is as follows:[9]
ne: वाणासुरको वंशावली यस प्रकार छ:[9]

source: Brahma's son was Marichi Marichi's son was Kashyapa, Kashyapa's sons were Hiranyakashipu and Hiranyaksha, Hiranyakashipu's son was Prahlada, Prahlada's son was Virochana, Virochana's son was Bali, Bali's son was Banasura
ne: ब्रह्मा का पुत्र मरिची मरिचीका पुत्र कश्यप, कश्यप का पुत्र हिरण्यकशिपु र हिरण्याक्ष, हिरण्यकशिपुका पुत्र प्रह्लाद प्रह्लादका पुत्र विरोचन विरोचनका पुत्र बलि राजा बलिका पुत्र वाणासुर

source: Sanskrit texts: How many days for Shukra (Venus) to complete its orbit? Source Estimated time per sidereal revolution[10] Surya Siddhanta 224 days, 16 hours, 45 minutes, 56.2 seconds Siddhanta Shiromani 224 days, 16 hours, 45 minutes, 1.9 seconds Ptolemy 224 days, 16 hours, 51 minutes, 56.8 seconds 20th century calculations 224 days, 16 hours, 49 minutes, 8.0 seconds
ne: Sanskrit texts: How many days for Shukra (Venus) to complete its orbit? संदार्भ अनुमानित समय [10] सुर्य सिद्धान्त २२४ दिन, १६ घण्टा, ४५ मिनेट, ५६.२ सेकेण्ड सिद्धान्त शिरोमणि २२४ दिन,१६ घण्टा, ४५ मिनेट , १.९ सेकेण्ड टोलेमी २२४ दिन , १६ घण्टा , ५१ मिनेट ५६.८ सेकेण्ड २० औ शताब्दीको गणित २२४ दिन, १६ घण्टा , ४९ मिन्र्ट ८ सेकेण्ड

source: Calendar and zodiac
ne: पात्रो र राशी

source: Planet
ne: ग्रह

source: Shukra (Sanskrit: शुक्र, IAST: Śukra) is a Sanskrit word that means "lucid, clear, bright". It also has other meanings, such as the name of an ancient sage who counseled Asuras in Vedic mythology.[1] In medieval mythology and Hindu astrology, the term refers to the planet Venus, one of the Navagrahas.[2]
ne: शुक्राचार्य ( शुक्र, IAST: Śukra) शुक्र "चम्किलो" बुझाउने संस्कृत शब्द हो। शुक्राचार्य वैदिक हिन्दु धर्मशास्त्र अनुसार असुरहरुका गुरु थिए [1] मध्य पौराणिक कथाअनुसार र हिन्दु ज्योतिषशास्त्र अनुसार शुक्रले नव ग्रह मध्येको एक शुक्र ग्रहलाई समेत जनाउँछ।[2]

source: In one ideology, Shukra is the name of a son of Bhrigu, of the third Manu, one of the saptarishis. He was the guru of Daityas / Asuras, and is also referred to as Shukracharya or Asuracharya in various Hindu texts. He named the Velleeswarar Temple, Mangadu after the blessings of the Trimurti, to mark the end of a long period of blindness.[3] In another account found in the Mahabharata, Shukra divided himself into two, one half becoming the knowledge source for the Devas (gods) and the other half being the knowledge source of the Asuras (demons).[2] Shukra in the Puranic ideology is famed as one with the knowledge that raises the dead back to life, something that helps the violent evil return back to life even after the gods and the forces of good destroy them; this knowledge is sought by the gods and is ultimately gained by them.[2]
ne: एक प्रसंगमा, शुक्र भृगु ऋषिका पुत्र थिए । उनी दैत्य/असुरहरुका गुरु भएकाले उनलाई कतिपति धार्मिक ग्रन्थहरुमा शुक्राचार्य तथा असुराचार्य पनि भनिन्छ । भारतको चेन्नेईमा रहेको भेल्लेश्वर मन्दिरको नामकरण उनैले गरेका थिए । [3] [2] पौराणिक कथाहरुका अनुसार उनीसंग मृत शरीरलाई पुनर्जीवित गर्न सक्ने विद्ध्या थियो , जुन उनले पछी देब्वाताहरुलाई समेत सिकाएका थिए ।[2]

source: In the Mahabharata, Shukracharya is mentioned as one of the mentors of Bhishma, having taught him political science in his youth.[4]
ne: महाभारतमा , शुक्राचार्यलाई भीष्मको गुरुको रुपमा देखिएको छ , जसले उनलाई युवावस्थामा राजनैतिक शास्त्रको बिद्याको शिक्षा दिक्षा दिएका थिए ।[4]

source: Shukra's mother was Kavyamata, whilst Shukra's wife was the goddess Jayanti, and their union produced Queen Devayani.
ne: शुक्रको मतको नाम काव्यमाता थियो भने उनको विवाह जयन्तीसंग भएको थियो । उनीहरुबाट देवयानी नाम गरेकी पुत्री भएको थियो ।

source: Shukra as a planet appears in various Hindu astronomical texts in Sanskrit, such as the 5th century Aryabhatiya by Aryabhatta, the 6th century Romaka by Latadeva and Panca Siddhantika by Varahamihira, the 7th century Khandakhadyaka by Brahmagupta and the 8th century Sisyadhivrddida by Lalla.[5][6] These texts present Shukra as one of the planets and estimate the characteristics of the respective planetary motion.[5] Other texts such as Surya Siddhanta dated to have been complete sometime between the 5th century and 10th century present their chapters on various planets with deity mythologies.[5]
ne: कतिपय हिन्दु ज्योतिषग्रन्थमा शुक्रलाई ग्रहको रुपमा प्रस्तुत गरिएको छ । उदाहरण ५ औ शताब्दीमा आर्यभट्टको आर्यभटिया, छैटौ शताब्दीमा लतादेवको रोमाका, ७ औ शताब्दी मा ब्रह्मगुप्त[5][6] यी ग्रन्थहरुले शुक्रलाइ एक ग्रहको रुपमा प्रस्तुत गरेर यसको चाल र गति को प्रक्षेपण गर्न खोजेका छन् ।[5]

source: The 1st millennium CE Hindu scholars had estimated the time it took for sidereal revolutions of each planet including Shukra, from their astronomical studies, with slightly different results:[10]
ne: हिन्दु बिद्वानहरुले शुक्र सहित सबै ग्रहहरुको ज्योतिष बिज्ञानको अध्ययनबाट नक्षत्र परिक्रमण समय अनुमान गरेका थिए ।[10]

source: Shukravara is found in most Indian languages, and Shukra Graha is driven by the planet Venus in Hindu astrology. The word "Friday" in the Greco-Roman and other Indo-European calendars is also based on the planet Venus. The zodiac and naming system of Hindu astrology likely developed in the centuries after the arrival of Greek astrology with Alexander the Great,[11][12][13] their zodiac signs being nearly identical.[14]
ne: हप्ताको छैटौ दिन शुक्रबार शुक्र ग्रहसंग गहिरो सम्बन्ध राख्छ ।

source: Varuna Asura Ahura Mazda Venus (astrology) Venus (mythology)
ne: वरुण असुर Ahura Mazda Venus (astrology) भेनस (देवी)

source: Shukra
ne: शुक्राचार्य

source: Origins and significance
ne: जन्म

source: Hiranyaksha (Sanskrit: हिरण्याक्ष, "golden-eyed") was an oppressive demon Asura who attacked the heavens and thereafter kidnapped and attempted to destroy the earth goddess in Hindu mythology.[1][2]
ne: हिरण्याक्ष "सुनौलो आँखा" एक अत्याचारी असुर राजा थिए, जसले स्वर्गमा आक्रमण गरे र पृथ्वी धर्तिलाई हरण गरे ।[1][2]

source: He married Aditi, with whom he fathered Agni, the Aditya. With his second wife, Diti, he begot the Daityas. In this Puranic version, the good Suras and evil Asuras are the children of the same Kashyapa, and there is a constant war between good and evil.
ne: पुराणका अनुसार उनी दिति र कश्यपका पुत्र थिए ।[1] कश्यप सप्तऋषि मध्येका एक ऋषि थिए । उनी सम्पूर्ण देव, असुर, नाग र मानवहरुको पिता थिए ।

source: Once, Hiranyaksha assaulted the defenseless Mother Earth and pulled her deep into the cosmic ocean. The demi-gods appealed to Vishnu to save the earth goddess and all life. Vishnu took the avatar of a man-boar (Varaha) and went to rescue the goddess.
ne: हिरण्याक्षले धर्ति पृथ्वीलाई हरण गरेर रसाताल पातालमा पुर्याए । तब सारा चराचर जगत नै जलमग्न भयो। यो देखेर ब्रह्मादी देवताहरू चिन्तित भएर भगवान बिष्णुको आराधना गरे। पृथ्वीलाई बचाउन भगवान विष्णुले वराह अवतार लिए । वराह तथा हिरण्याक्षका बीच कयौं वर्षसम्म भयंकर युद्ध भयो । अन्ततः वराहका सिङद्वारा हिरण्याक्ष मारियो ।[1][2]

source: He, as the hero in the legend, descends into the ocean, finds her, she hangs onto his tusk, he lifts her out to safety. The good wins, the crisis ends, and Vishnu once again fulfills his cosmic duty. The Varaha legend has been one of many historic legends in the Hindu text embedded with right versus wrong, good versus evil symbolism, and of someone willing to go to the depths and do what is necessary to rescue the good, the right, the dharma.[3][4][5]
ne: पौराणिक कालमा कश्यप ऋषिकी पत्नी दितिलाई गर्भ रहेको ३ वर्ष सम्म पनि बच्चा जन्मिएन। यो देखेर सबै देवताहरू र ऋषी कश्यप ब्रम्हाजी सँग सोध्न गए। ब्रह्माजीले सबै कुरा सुने आफ्नो योग दृष्टी लगाए। त्यसपछी ब्रह्माजीले सबैलाई गर्भबाट २ वटा बालकहरू जन्मिने तर अनिष्टकार बालकको जन्म हुने बताए । यो सुनेर सबै चिन्तित भएर आफ्नो आफ्नो धाममा फर्किए। केही दिन पछाडी दितीको गर्भबाट हिरण्याक्ष तथा हिरण्यकशेपु नामका दुईवटा बालकहरूको जन्म भयो। बालकै छँदा यी दुवैले स्वर्ग मर्त्य तिनै लोकमा उप्रदव मचाउन थाले। हिरण्याक्ष ठूलो भए पछि महाबली असुर भयो। ब्रह्माजीको कठोर तपश्या गरेकाले ब्रह्माजीले हिरण्याक्षलाई इछ्छा अनुसारको बरदान माग्ने अनुमती दिए। ब्रह्माजीको आज्ञा पाएर हिरण्याक्षले सँधै अमर रहन पाउने बरदान माग्यो। ब्रह्माजीले जन्मिएपछी मर्नु पर्छ अमरताको बरदान दिन सकिदैन यो बाहेक केही अरु बरदान माग्ने कुरा राखे तर हिरण्याक्ष आफु अमरता बाहेक अरु कोही बर नमाग्ने ढिट गर्न थाल्यो। हिरण्याक्षले गरेको तपश्यालाई ध्यानमा राखेर ब्रह्माजीले जनावर बाहेक मनुष्य, देवता, यक्ष, किन्नर, आदी कसैको हातबाट मृत्यु नहुने बरदान दिए। हिरण्याक्षले जनावर सामान्य नै हो भन्ने सोच गरेर ब्रह्माको बरदान स्विकार गर्‍यो तै पनि जनावर जो आमाको कोखबाट पैदा नभएको जनावरले मात्र मार्न पाउने बचन राखेरै छोड्यो। ब्रह्माको बरदान पाएर हिरण्याक्षले जता ततै उत्पात मचाउन थाल्यो।

source: Preceded by Prahalad Daityas unknown Succeeded by Mahabali
ne: पुर्वाधिकारी प्रह्लाद दैत्य उत्तराधिकारी

source: Virochana (Sanskrit: विरोचन), in Hindu mythology, was grandson of Hiranyakashipu, son of Prahlada (Sanskrit: प्रह्लाद) and father of Bali. In the Atharvaveda (VIII.10.22) he was mentioned as the son of Prahlada.[1] According to the Chandogya Upanishad (VIII.7.2-8.5), he and Indra went to Prajapati to learn about the atman (self) and lived there, practising brahmacharya for thirty-two years. [2] The son of Virochana was Mahabali.[3]
ne: विरोचन हिन्दु पौराणिक मिथकीय कथामा हिरण्यकश्यपुका नाति , प्रह्लाद का पुत्र र बलि राजाका पिता थिए। अथर्ववेदमा उनलाई प्रह्लादका पुत्रका रुपमा प्रस्तुत गरिएको छ [1] । छान्दोग्य उपनिषद् अनुसार, उनी र इन्द्र आत्मनको बारेमा जान्न बुझ्न प्रजापतिको अगाडी गएका थिए र त्यहाँ ब्रह्मचर्य धर्मको पालना गर्दै बत्तीस बर्ष बसेका थिए ।[2]
